app/serializers/order_serializer.rb


     attribute :products do |object|
     if @object.present?
        @object.products.map do |product|
---
SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 83]]