app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 ORDER BY "notifications"."created_at" DESC  [["user_id", 18]]
---
	def index
		# puts "@current_user: #{@current_user.inspect}"
		@notifications = @current_user.notifications.order(created_at: :desc)

INSERT INTO "notifications" ("user_id", "message", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 18], ["message", "hello"], ["read", true], ["created_at", "2024-02-22 09:27:37.058406"], ["updated_at", "2024-02-22 09:27:37.058406"]]
---
	def create
		@notification = @current_user.notifications.new(notification_params)

		if @notification.save

DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 2]]
---
	def destroy
		if @notification.destroy

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 3], ["LIMIT", 1]]
---
	def set_notification
		@notification = @current_user.notifications.find(params[:id])