app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "password_digest", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at", "reset_password_used", "stripe_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

	def update
		@current_user == @user
		if @current_user.present?
			@current_user&.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "phone" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "brajesh"], ["last_name", "kumar"], ["phone", 987654321], ["updated_at", "2024-02-13 05:06:02.876736"], ["id", 9]]

	def destroy
		@current_user == @user
		if @current_user.present?
			@current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]