app/models/order.rb

	def send_notification
		Notification.create(user_id: self.user_id, message: "your order has been placed successfully")
---
INSERT INTO "notifications" ("user_id", "message", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 19], ["message", "your order has been successfully placed"], ["read", nil], ["created_at", "2024-02-23 07:33:57.666654"], ["updated_at", "2024-02-23 07:33:57.666654"]]

    def send_update_notification
		Notification.create(user_id: self.user_id, message: "your order has been #{self.status} successfully")
---
INSERT INTO "notifications" ("user_id", "message", "read", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 19], ["message", "your order has been successfully shipped"], ["read", nil], ["created_at", "2024-02-23 07:22:09.449497"], ["updated_at", "2024-02-23 07:22:09.449497"]]