app/models/user.rb

INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2024-02-26 13:23:28.957264"], ["updated_at", "2024-02-26 13:23:28.957264"], ["user_id", 30]]
---
  def  create_cart
    Cart.create(user_id: self.id)

UPDATE "users" SET "updated_at" = $1, "stripe_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-02-26 13:23:29.547508"], ["stripe_id", "cus_PdKpwy5fNKQq13"], ["id", 30]]
---
  def create_stripe_account
    # Stripe.api_key = ENV['STRIPE_SECRET_KEY']
    customer = Stripe::Customer.create(
      email: self.email,
      )

    self.update(stripe_id: customer.id)